<template>
    <div class="biggest-wrapper">
    <div class="big-wrapper">
        <Aside :activeLink="1" :sideMenuActive="this.sideMenuActive" :isAdmin="true" />
        <div class="wrapper">
            <Header :searchIsActive="false" :title="'Каталог'" @openSideMenu="SideMenuToActive" :isAdmin="true" />
            <main class="main main-admin-catalog">
                <section class="main__admin-catalog admin-catalog">
                    <div class="admin-catalog__top admin-catalog-top">
                        <button class="admin-catalog-top__btn" type="button">
                            <svg width="33" height="32" viewBox="0 0 33 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M25.833 14.6663H17.833V6.66634C17.833 6.31272 17.6925 5.97358 17.4425 5.72353C17.1924 5.47348 16.8533 5.33301 16.4997 5.33301C16.1461 5.33301 15.8069 5.47348 15.5569 5.72353C15.3068 5.97358 15.1663 6.31272 15.1663 6.66634V14.6663H7.16634C6.81272 14.6663 6.47358 14.8068 6.22353 15.0569C5.97348 15.3069 5.83301 15.6461 5.83301 15.9997C5.83301 16.3533 5.97348 16.6924 6.22353 16.9425C6.47358 17.1925 6.81272 17.333 7.16634 17.333H15.1663V25.333C15.1663 25.6866 15.3068 26.0258 15.5569 26.2758C15.8069 26.5259 16.1461 26.6663 16.4997 26.6663C16.8533 26.6663 17.1924 26.5259 17.4425 26.2758C17.6925 26.0258 17.833 25.6866 17.833 25.333V17.333H25.833C26.1866 17.333 26.5258 17.1925 26.7758 16.9425C27.0259 16.6924 27.1663 16.3533 27.1663 15.9997C27.1663 15.6461 27.0259 15.3069 26.7758 15.0569C26.5258 14.8068 26.1866 14.6663 25.833 14.6663Z"
                                    fill="#1294F2" />
                            </svg>

                            Создать курс
                        </button>
                        <div class="admin-catalog-top__select admin-catalog-top-select" @click="openSelect">
                            <div class="admin-catalog-top-select__box">
                                <p class="admin-catalog-top-select__box-text">
                                    Направление
                                </p>
                                <svg class="author-info-content-item__arrow" width="32" height="28" viewBox="0 0 32 28"
                                    fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                        fill="#96A5B8"></path>
                                </svg>
                            </div>
                            <div class="admin-catalog-top-select__bottom">
                                <button class="admin-catalog-top-select__bottom-btn" type="button" data-filter='.item-first'>
                                    Кибербезопастность
                                </button>
                                <button class="admin-catalog-top-select__bottom-btn" type="button" data-filter='.item-second'>
                                    Кибербезопастность
                                </button>
                                <button class="admin-catalog-top-select__bottom-btn" type="button" data-filter='.item-third'>
                                    Кибербезопастность
                                </button>
                                <button class="admin-catalog-top-select__bottom-btn" type="button" data-filter='.item-fourth'>
                                    Кибербезопастность
                                </button>
                            </div>
                        </div>
                        <form class="admin-catalog-top__form" action="#">
                            <input class="admin-catalog-top__form-input" type="text" placeholder="Поиск">
                            <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M14.9235 14.5525L15.2776 14.1995L15.2773 14.1992L14.9235 14.5525ZM10.8445 10.468L10.4972 10.1083L10.1314 10.4615L10.4907 10.8213L10.8445 10.468ZM10.4388 10.8243L10.7926 10.471L10.4765 10.1544L10.1268 10.4335L10.4388 10.8243ZM14.5276 14.9189L14.8825 14.5666L14.8815 14.5655L14.5276 14.9189ZM14.9158 14.9263L15.255 15.2936L15.2556 15.293L14.9158 14.9263ZM15.2773 14.1992L11.1983 10.1146L10.4907 10.8213L14.5697 14.9058L15.2773 14.1992ZM11.1919 10.8276C12.3232 9.73512 13.0295 8.22281 13.0295 6.55073H12.0295C12.0295 7.93367 11.4467 9.19143 10.4972 10.1083L11.1919 10.8276ZM13.0295 6.55073C13.0295 3.1961 10.2017 0.5 6.76474 0.5V1.5C9.68544 1.5 12.0295 3.7837 12.0295 6.55073H13.0295ZM6.76474 0.5C3.32775 0.5 0.5 3.1961 0.5 6.55073H1.5C1.5 3.7837 3.84404 1.5 6.76474 1.5V0.5ZM0.5 6.55073C0.5 9.90536 3.32775 12.6015 6.76474 12.6015V11.6015C3.84404 11.6015 1.5 9.31776 1.5 6.55073H0.5ZM6.76474 12.6015C8.27625 12.6015 9.66626 12.0809 10.7508 11.215L10.1268 10.4335C9.2151 11.1615 8.04392 11.6015 6.76474 11.6015V12.6015ZM10.085 11.1776L14.1738 15.2722L14.8815 14.5655L10.7926 10.471L10.085 11.1776ZM14.1728 15.2712C14.3272 15.4266 14.53 15.5 14.7256 15.5V14.5C14.7768 14.5 14.8357 14.5194 14.8825 14.5666L14.1728 15.2712ZM14.7256 15.5C14.9131 15.5 15.1045 15.4326 15.255 15.2936L14.5767 14.5589C14.6206 14.5183 14.6753 14.5 14.7256 14.5V15.5ZM15.2556 15.293C15.5724 14.9995 15.5828 14.5057 15.2776 14.1995L14.5694 14.9055C14.4739 14.8097 14.4777 14.6505 14.576 14.5595L15.2556 15.293ZM6.76474 11.0728C4.14683 11.0728 2.04902 9.02621 2.04902 6.55073H1.04902C1.04902 9.61382 3.63054 12.0728 6.76474 12.0728V11.0728ZM2.04902 6.55073C2.04902 4.07525 4.14683 2.02864 6.76474 2.02864V1.02864C3.63054 1.02864 1.04902 3.48764 1.04902 6.55073H2.04902ZM6.76474 2.02864C9.38265 2.02864 11.4805 4.07525 11.4805 6.55073H12.4805C12.4805 3.48764 9.89894 1.02864 6.76474 1.02864V2.02864ZM11.4805 6.55073C11.4805 9.0262 9.38239 11.0728 6.76474 11.0728V12.0728C9.89865 12.0728 12.4805 9.61384 12.4805 6.55073H11.4805Z"
                                    fill="#96A5B8"></path>
                            </svg>
                        </form>
                    </div>
                    <div class="admin-catalog__inner">
                        <swiper class="admin-catalog__swiper admin-catalog-swiper swiper mix item-first" :modules="modules"
                            :slides-per-view="1" :speed="1" :space-between="200" navigation
                            :pagination="{ clickable: true, }" :loop="true" @swiper="onSwiper" @slideChange="onSlideChange">
                            <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                                <div class="author-info__content author-info-content">
                                    <div class="author-info-content__top">
                                        <p class="author-info-content__top-text">
                                            №
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Название
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Автор
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Направление
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Статус
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Дата обновления
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Доступные языки
                                        </p>
                                    </div>
                                    <div class="author-info-content__inner">
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                1
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                2
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                3
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                4
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                                <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                    <p class="fishing-attacks-swiper-slide-count__text">
                                        Запись на странице
                                    </p>
                                    <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                    </PageEntrySelect>
                                </div>
                            </swiper-slide>
                            <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                                <div class="author-info__content author-info-content">
                                    <div class="author-info-content__top">
                                        <p class="author-info-content__top-text">
                                            №
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Название
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Автор
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Направление
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Статус
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Дата обновления
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Доступные языки
                                        </p>
                                    </div>
                                    <div class="author-info-content__inner">
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                1
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                2
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                3
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                4
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                                <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                    <p class="fishing-attacks-swiper-slide-count__text">
                                        Запись на странице
                                    </p>
                                    <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                    </PageEntrySelect>
                                </div>
                            </swiper-slide>
                            <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                                <div class="author-info__content author-info-content">
                                    <div class="author-info-content__top">
                                        <p class="author-info-content__top-text">
                                            №
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Название
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Автор
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Направление
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Статус
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Дата обновления
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Доступные языки
                                        </p>
                                    </div>
                                    <div class="author-info-content__inner">
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                1
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                2
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                3
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                4
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.01.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                                <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                    <p class="fishing-attacks-swiper-slide-count__text">
                                        Запись на странице
                                    </p>
                                    <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                    </PageEntrySelect>
                                </div>
                            </swiper-slide>
                            <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                                <div class="author-info__content author-info-content">
                                    <div class="author-info-content__top">
                                        <p class="author-info-content__top-text">
                                            №
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Название
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Автор
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Направление
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Статус
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Дата обновления
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Доступные языки
                                        </p>
                                    </div>
                                    <div class="author-info-content__inner">
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                1
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                2
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.9
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                3
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                4
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                                <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                    <p class="fishing-attacks-swiper-slide-count__text">
                                        Запись на странице
                                    </p>
                                    <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                    </PageEntrySelect>
                                </div>
                            </swiper-slide>
                        </swiper>
                        <swiper class="admin-catalog__swiper admin-catalog-swiper swiper mix item-second" :modules="modules"
                        :slides-per-view="1" :speed="1" :space-between="200" navigation
                        :pagination="{ clickable: true, }" :loop="true" @swiper="onSwiper" @slideChange="onSlideChange">
                        <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                            <div class="author-info__content author-info-content">
                                <div class="author-info-content__top">
                                    <p class="author-info-content__top-text">
                                        №
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Название
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Автор
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Направление
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Статус
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Дата обновления
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Доступные языки
                                    </p>
                                </div>
                                <div class="author-info-content__inner">
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            1
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            2
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    3
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            3
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            4
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                </div>
                            </div>
                            <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                <p class="fishing-attacks-swiper-slide-count__text">
                                    Запись на странице
                                </p>
                                <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                </PageEntrySelect>
                            </div>
                        </swiper-slide>
                        <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                            <div class="author-info__content author-info-content">
                                <div class="author-info-content__top">
                                    <p class="author-info-content__top-text">
                                        №
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Название
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Автор
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Направление
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Статус
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Дата обновления
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Доступные языки
                                    </p>
                                </div>
                                <div class="author-info-content__inner">
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            1
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            2
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            3
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            4
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                </div>
                            </div>
                            <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                <p class="fishing-attacks-swiper-slide-count__text">
                                    Запись на странице
                                </p>
                                <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                </PageEntrySelect>
                            </div>
                        </swiper-slide>
                        <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                            <div class="author-info__content author-info-content">
                                <div class="author-info-content__top">
                                    <p class="author-info-content__top-text">
                                        №
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Название
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Автор
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Направление
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Статус
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Дата обновления
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Доступные языки
                                    </p>
                                </div>
                                <div class="author-info-content__inner">
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            1
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            2
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            3
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            4
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.01.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                </div>
                            </div>
                            <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                <p class="fishing-attacks-swiper-slide-count__text">
                                    Запись на странице
                                </p>
                                <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                </PageEntrySelect>
                            </div>
                        </swiper-slide>
                        <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                            <div class="author-info__content author-info-content">
                                <div class="author-info-content__top">
                                    <p class="author-info-content__top-text">
                                        №
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Название
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Автор
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Направление
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Статус
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Дата обновления
                                    </p>
                                    <p class="author-info-content__top-text">
                                        Доступные языки
                                    </p>
                                </div>
                                <div class="author-info-content__inner">
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            1
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            2
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.9
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            3
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                    <a href="#" class="author-info-content__item author-info-content-item">
                                        <p class="author-info-content-item__text">
                                            4
                                        </p>
                                        <img class="author-info-content-item__img"
                                            src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                        <div class="author-info-content-item__box">
                                            <p class="author-info-content-item__box-text">
                                                Электронная почта
                                            </p>
                                            <p class="author-info-content-item__box-rait">
                                                <span>
                                                    Рейтинг:
                                                </span>
                                                <span>
                                                    4.5
                                                </span>
                                                <span>
                                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path
                                                            d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                            fill="#1294F2" />
                                                    </svg>
                                                </span>
                                            </p>
                                        </div>
                                        <p class="author-info-content-item__subsc">
                                            Synapsys
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Кибербезопастность
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            Опубликовано
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            16.11.2022
                                        </p>
                                        <p class="author-info-content-item__subsc">
                                            RU
                                        </p>
                                        <svg class="author-info-content-item__arrow" width="32" height="28"
                                            viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#96A5B8" />
                                        </svg>
                                    </a>
                                </div>
                            </div>
                            <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                <p class="fishing-attacks-swiper-slide-count__text">
                                    Запись на странице
                                </p>
                                <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                </PageEntrySelect>
                            </div>
                        </swiper-slide>
                    </swiper>
                    <swiper class="admin-catalog__swiper admin-catalog-swiper swiper mix item-third" :modules="modules"
                    :slides-per-view="1" :speed="1" :space-between="200" navigation
                    :pagination="{ clickable: true, }" :loop="true" @swiper="onSwiper" @slideChange="onSlideChange">
                    <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                        <div class="author-info__content author-info-content">
                            <div class="author-info-content__top">
                                <p class="author-info-content__top-text">
                                    №
                                </p>
                                <p class="author-info-content__top-text">
                                    Название
                                </p>
                                <p class="author-info-content__top-text">
                                    Автор
                                </p>
                                <p class="author-info-content__top-text">
                                    Направление
                                </p>
                                <p class="author-info-content__top-text">
                                    Статус
                                </p>
                                <p class="author-info-content__top-text">
                                    Дата обновления
                                </p>
                                <p class="author-info-content__top-text">
                                    Доступные языки
                                </p>
                            </div>
                            <div class="author-info-content__inner">
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        1
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        2
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        3
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        4
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                            </div>
                        </div>
                        <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                            <p class="fishing-attacks-swiper-slide-count__text">
                                Запись на странице
                            </p>
                            <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                            </PageEntrySelect>
                        </div>
                    </swiper-slide>
                    <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                        <div class="author-info__content author-info-content">
                            <div class="author-info-content__top">
                                <p class="author-info-content__top-text">
                                    №
                                </p>
                                <p class="author-info-content__top-text">
                                    Название
                                </p>
                                <p class="author-info-content__top-text">
                                    Автор
                                </p>
                                <p class="author-info-content__top-text">
                                    Направление
                                </p>
                                <p class="author-info-content__top-text">
                                    Статус
                                </p>
                                <p class="author-info-content__top-text">
                                    Дата обновления
                                </p>
                                <p class="author-info-content__top-text">
                                    Доступные языки
                                </p>
                            </div>
                            <div class="author-info-content__inner">
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        1
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        2
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        3
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        4
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                            </div>
                        </div>
                        <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                            <p class="fishing-attacks-swiper-slide-count__text">
                                Запись на странице
                            </p>
                            <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                            </PageEntrySelect>
                        </div>
                    </swiper-slide>
                    <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                        <div class="author-info__content author-info-content">
                            <div class="author-info-content__top">
                                <p class="author-info-content__top-text">
                                    №
                                </p>
                                <p class="author-info-content__top-text">
                                    Название
                                </p>
                                <p class="author-info-content__top-text">
                                    Автор
                                </p>
                                <p class="author-info-content__top-text">
                                    Направление
                                </p>
                                <p class="author-info-content__top-text">
                                    Статус
                                </p>
                                <p class="author-info-content__top-text">
                                    Дата обновления
                                </p>
                                <p class="author-info-content__top-text">
                                    Доступные языки
                                </p>
                            </div>
                            <div class="author-info-content__inner">
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        1
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        2
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        3
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        4
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.01.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                            </div>
                        </div>
                        <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                            <p class="fishing-attacks-swiper-slide-count__text">
                                Запись на странице
                            </p>
                            <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                            </PageEntrySelect>
                        </div>
                    </swiper-slide>
                    <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                        <div class="author-info__content author-info-content">
                            <div class="author-info-content__top">
                                <p class="author-info-content__top-text">
                                    №
                                </p>
                                <p class="author-info-content__top-text">
                                    Название
                                </p>
                                <p class="author-info-content__top-text">
                                    Автор
                                </p>
                                <p class="author-info-content__top-text">
                                    Направление
                                </p>
                                <p class="author-info-content__top-text">
                                    Статус
                                </p>
                                <p class="author-info-content__top-text">
                                    Дата обновления
                                </p>
                                <p class="author-info-content__top-text">
                                    Доступные языки
                                </p>
                            </div>
                            <div class="author-info-content__inner">
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        1
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        2
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.9
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        3
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                                <a href="#" class="author-info-content__item author-info-content-item">
                                    <p class="author-info-content-item__text">
                                        4
                                    </p>
                                    <img class="author-info-content-item__img"
                                        src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                    <div class="author-info-content-item__box">
                                        <p class="author-info-content-item__box-text">
                                            Электронная почта
                                        </p>
                                        <p class="author-info-content-item__box-rait">
                                            <span>
                                                Рейтинг:
                                            </span>
                                            <span>
                                                4.5
                                            </span>
                                            <span>
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                        fill="#1294F2" />
                                                </svg>
                                            </span>
                                        </p>
                                    </div>
                                    <p class="author-info-content-item__subsc">
                                        Synapsys
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Кибербезопастность
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        Опубликовано
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        16.11.2022
                                    </p>
                                    <p class="author-info-content-item__subsc">
                                        RU
                                    </p>
                                    <svg class="author-info-content-item__arrow" width="32" height="28"
                                        viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                            fill="#96A5B8" />
                                    </svg>
                                </a>
                            </div>
                        </div>
                        <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                            <p class="fishing-attacks-swiper-slide-count__text">
                                Запись на странице
                            </p>
                            <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                            </PageEntrySelect>
                        </div>
                    </swiper-slide>
                </swiper>
                  <swiper class="admin-catalog__swiper admin-catalog-swiper swiper mix item-fourth" :modules="modules"
                            :slides-per-view="1" :speed="1" :space-between="200" navigation
                            :pagination="{ clickable: true, }" :loop="true" @swiper="onSwiper" @slideChange="onSlideChange">
                            <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                                <div class="author-info__content author-info-content">
                                    <div class="author-info-content__top">
                                        <p class="author-info-content__top-text">
                                            №
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Название
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Автор
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Направление
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Статус
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Дата обновления
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Доступные языки
                                        </p>
                                    </div>
                                    <div class="author-info-content__inner">
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                1
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                2
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                3
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                4
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                                <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                    <p class="fishing-attacks-swiper-slide-count__text">
                                        Запись на странице
                                    </p>
                                    <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                    </PageEntrySelect>
                                </div>
                            </swiper-slide>
                            <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                                <div class="author-info__content author-info-content">
                                    <div class="author-info-content__top">
                                        <p class="author-info-content__top-text">
                                            №
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Название
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Автор
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Направление
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Статус
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Дата обновления
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Доступные языки
                                        </p>
                                    </div>
                                    <div class="author-info-content__inner">
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                1
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                2
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                3
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                4
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                                <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                    <p class="fishing-attacks-swiper-slide-count__text">
                                        Запись на странице
                                    </p>
                                    <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                    </PageEntrySelect>
                                </div>
                            </swiper-slide>
                            <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                                <div class="author-info__content author-info-content">
                                    <div class="author-info-content__top">
                                        <p class="author-info-content__top-text">
                                            №
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Название
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Автор
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Направление
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Статус
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Дата обновления
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Доступные языки
                                        </p>
                                    </div>
                                    <div class="author-info-content__inner">
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                1
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                2
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                3
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                4
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.01.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                                <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                    <p class="fishing-attacks-swiper-slide-count__text">
                                        Запись на странице
                                    </p>
                                    <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                    </PageEntrySelect>
                                </div>
                            </swiper-slide>
                            <swiper-slide class="admin-catalog-swiper__slide admin-catalog-swiper-slide">
                                <div class="author-info__content author-info-content">
                                    <div class="author-info-content__top">
                                        <p class="author-info-content__top-text">
                                            №
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Название
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Автор
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Направление
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Статус
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Дата обновления
                                        </p>
                                        <p class="author-info-content__top-text">
                                            Доступные языки
                                        </p>
                                    </div>
                                    <div class="author-info-content__inner">
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                1
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                2
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.9
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                3
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                        <a href="#" class="author-info-content__item author-info-content-item">
                                            <p class="author-info-content-item__text">
                                                4
                                            </p>
                                            <img class="author-info-content-item__img"
                                                src="../../../public/images/autor-info-bottom-img-1.png" alt="image">
                                            <div class="author-info-content-item__box">
                                                <p class="author-info-content-item__box-text">
                                                    Электронная почта
                                                </p>
                                                <p class="author-info-content-item__box-rait">
                                                    <span>
                                                        Рейтинг:
                                                    </span>
                                                    <span>
                                                        4.5
                                                    </span>
                                                    <span>
                                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                            xmlns="http://www.w3.org/2000/svg">
                                                            <path
                                                                d="M17.5236 21.0041C17.3637 21.0048 17.206 20.967 17.0636 20.8941L11.9636 18.2241L6.86363 20.8941C6.69802 20.9812 6.51131 21.0201 6.32471 21.0063C6.13811 20.9926 5.95911 20.9267 5.80806 20.8163C5.65701 20.7059 5.53997 20.5553 5.47024 20.3817C5.40052 20.208 5.3809 20.0183 5.41363 19.8341L6.41363 14.2041L2.29363 10.2041C2.16509 10.0758 2.0739 9.91498 2.02986 9.7388C1.98581 9.56263 1.99057 9.37778 2.04363 9.20411C2.10159 9.02638 2.20821 8.86846 2.35138 8.74827C2.49455 8.62807 2.66855 8.55042 2.85363 8.52411L8.55363 7.69411L11.0636 2.56411C11.1455 2.39504 11.2734 2.25245 11.4325 2.15268C11.5917 2.05292 11.7758 2 11.9636 2C12.1515 2 12.3355 2.05292 12.4947 2.15268C12.6539 2.25245 12.7817 2.39504 12.8636 2.56411L15.4036 7.68411L21.1036 8.51411C21.2887 8.54042 21.4627 8.61807 21.6059 8.73827C21.7491 8.85846 21.8557 9.01638 21.9136 9.19411C21.9667 9.36778 21.9714 9.55263 21.9274 9.7288C21.8834 9.90498 21.7922 10.0658 21.6636 10.1941L17.5436 14.1941L18.5436 19.8241C18.5793 20.0116 18.5606 20.2054 18.4898 20.3826C18.4189 20.5598 18.2988 20.713 18.1436 20.8241C17.9625 20.951 17.7445 21.0143 17.5236 21.0041Z"
                                                                fill="#1294F2" />
                                                        </svg>
                                                    </span>
                                                </p>
                                            </div>
                                            <p class="author-info-content-item__subsc">
                                                Synapsys
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Кибербезопастность
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                Опубликовано
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                16.11.2022
                                            </p>
                                            <p class="author-info-content-item__subsc">
                                                RU
                                            </p>
                                            <svg class="author-info-content-item__arrow" width="32" height="28"
                                                viewBox="0 0 32 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                    fill="#96A5B8" />
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                                <div class="fishing-attacks-swiper-slide__count fishing-attacks-swiper-slide-count">
                                    <p class="fishing-attacks-swiper-slide-count__text">
                                        Запись на странице
                                    </p>
                                    <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                    </PageEntrySelect>
                                </div>
                            </swiper-slide>
                        </swiper>
                    </div>
                </section>
            </main>
            <Footer />
        </div>
    </div>
    </div>
</template>

<script>
import Aside from '../../components/portal-components/Aside.vue';
import Header from '../../components/portal-components/Header.vue';
import Footer from '../../components/portal-components/Footer.vue';
import PageEntrySelect from '../../components/admin-components/Page-entry-select.vue';
import NewCursSelect from '../../components/admin-components/New-curs-select.vue';

import { Pagination, Autoplay, Navigation } from 'swiper';
import { Swiper, SwiperSlide } from 'swiper/vue';

import 'swiper/css';
import 'swiper/css/pagination';

export default {
    components: {
        Aside,
        Header,
        Footer,
        PageEntrySelect,
        Swiper,
        SwiperSlide,
        NewCursSelect
    },
    data() {
        return {
            sideMenuActive: false,
        }
    },
    setup() {
        const onSwiper = (swiper) => {
        };
        const onSlideChange = () => {
        };
        return {
            onSwiper,
            onSlideChange,
            modules: [Pagination, Autoplay, Navigation],
        };
    },
    mounted() {
        var mixer = mixitup('.admin-catalog__inner', {
            load: {
                filter: '.item-first'
            },
            animation: {
                enable: false
            },
        })
    },
    methods: {
        changedInfo() {
        },
        SideMenuToActive() {
            if (this.sideMenuActive == true) {
                this.sideMenuActive = false
            } else {
                this.sideMenuActive = true
            }
        },
        openSelect() {
            document.querySelector('.admin-catalog-top-select').classList.toggle('admin-catalog-top-select--active')
        }
    }

}
</script>


<style lang="scss">
@import '../../assets/scss/vars';

.main-admin-catalog {
    padding: 30px 55px 35px 55px;
}

.admin-catalog {

    &__inner {}
}

.admin-catalog-top {
    display: flex;
    align-items: center;
    margin-bottom: 30px;

    &__btn {
        padding: 12px;
        gap: 4px;
        display: flex;
        align-items: center;
        font-weight: 500;
        font-size: 16px;
        max-height: 50px;
        justify-content: center;
        line-height: 24px;
        text-align: center;
        color: #FFFFFF;
        width: 180px;
        background: #1294F2;
        border-radius: 6px;

        svg {
            width: 16px;
            height: 16px;

            path {
                fill: #fff;
            }
        }

        svg path {
            transition: fill 0.3s;
            fill: #fff;
        }

        transition: background 0.3s, border 0.3s, color 0.3s;
        border: 1px solid transparent;
        &:hover {
            background: transparent;
            border: 1px solid #1294F2;
            color: #1294F2;
            svg path {
                fill: #1294F2;
            }
        }
    }

    &__form {
        width: 540px;
        border: 1.5px solid #96A5B8;
        border-radius: 15px;
        position: relative;
        margin-left: 25px;

        svg {
            position: absolute;
            width: 14px;
            height: 14px;
            top: 50%;
            left: 23px;
            transform: translateY(-50%);
        }
    }

    &__form-input {
        padding: 17px 30px 17px 50px;
        border-radius: 16px;
        width: 100%;
        font-size: 16px;
        line-height: 17px;
        font-weight: 500;
        color: #96A5B8;
        letter-spacing: 0.14px;

        &::placeholder {
            font-size: 16px;
            line-height: 17px;
            font-weight: 500;
            color: #96A5B8;
        }
        &:focus {
            &::placeholder {
                opacity: 0;
            }
        }
    }
}

.admin-catalog-top-select {
    margin-left: auto;
    max-width: 195px;
    position: relative;
    .mixitup-control-active {
        color: #1294F2;
    }
    &__box {
        padding: 12px 24px;
        display: flex;
        align-items: center;
        border: 1px solid #1294F2;
        border-radius: 6px;
        gap: 10px;
        cursor: pointer;
        svg {
            min-width: 24px;
            min-height: 24px;
            transform: rotate(-90deg);
        }
    }

    &__box-text {
        font-weight: 500;
        font-size: 16px;
        line-height: 24px;
        color: #1294F2;
    }

    &__bottom {
        position: absolute;
        top: 60px;
        left: 0;
        z-index: 10;
        background: #fff;
        border-radius: 6px;
        width: 270px;
        border: 1px solid #1294F2;
        display: none;
    }

    &__bottom-btn {
        padding: 13px 10px 13px 24px;

        font-weight: 500;
        font-size: 16px;
        line-height: 24px;
        color: #96A5B8;
        transition: color 0.3s;
        &:hover {
            color: #1294F2;
        }
    }
}

.admin-catalog-swiper {
    max-width: 1450px;
    position: relative;
    width: 100%;

    .swiper-pagination {
        max-width: 500px;
        position: absolute;
        margin-left: auto;
        right: 0;
        bottom: 0;
        top: unset !important;
        display: flex;
        justify-content: flex-end;
        padding-right: 58px;
    }

    .swiper-pagination-bullet {
        background: #FFFFFF;
        width: 48px;
        height: 48px;
        opacity: 1;
        border: 1px solid #96A5B8;
        border-radius: 6px;
        font-weight: 500;
        font-size: 16px;
        line-height: 24px;
        color: #96A5B8;
        transition: background 0.3s, color 0.3s border 0.3s;
        margin-left: 5px !important;
        position: relative;
        margin-right: 5px !important;

        &:hover {
            background: #1294F2;
            color: #fff;
            border: 1px solid #1294F2;

            &::before {
                color: #fff;
            }
        }

        &::before {
            content: '';
            transition: color 0.3s;
            position: absolute;
            top: 50%;
            left: 50%;
            font-weight: 500;
            font-size: 16px;
            line-height: 24px;
            color: #96A5B8;
            transform: translateX(-50%) translateY(-50%);
        }

        &:nth-child(1) {
            &::before {
                content: '1';
            }
        }

        &:nth-child(2) {
            &::before {
                content: '2';
            }
        }

        &:nth-child(3) {
            &::before {
                content: '3';
            }
        }

        &:nth-child(4) {
            &::before {
                content: '4';
            }
        }
    }

    .swiper-pagination-bullet-active {
        background: #1294F2 !important;
        color: #fff;
        border: 1px solid #1294F2;

        &::before {
            color: #fff;
        }
    }

    .swiper-button-prev {
        cursor: pointer;
        position: relative;
        background: #FFFFFF;
        width: 48px;
        height: 48px;
        border: 1px solid #96A5B8;
        border-radius: 6px;
        position: absolute;
        right: 0;
        transform: translateX(-615%);
        bottom: 0;
        z-index: 20;

        &::before {
            content: '';
            position: absolute;
            top: 50%;
            left: 50%;
            transform: translateX(-50%) translateY(-50%) rotate(90deg);
            width: 32px;
            height: 32px;
            background-repeat: no-repeat;
            background-image: url(../../../public/images/reg-two-arrow.svg);
        }
    }

    .swiper-button-next {
        cursor: pointer;
        z-index: 20;
        position: absolute;
        background: #FFFFFF;
        width: 48px;
        height: 48px;
        border: 1px solid #96A5B8;
        border-radius: 6px;
        right: 0;
        bottom: 0;

        &::before {
            content: '';
            position: absolute;
            top: 50%;
            left: 50%;
            transform: translateX(-50%) translateY(-50%) rotate(270deg);
            width: 32px;
            height: 32px;
            background-repeat: no-repeat;
            background-image: url(../../../public/images/reg-two-arrow.svg);
        }
    }
}


.admin-catalog-swiper-slide {
    padding-bottom: 365px;
}

.fishing-attacks-swiper-slide-count {

    &__text {}
}

.admin-catalog-top-select--active {
    .admin-catalog-top-select__bottom {
        display: block;
    }
    svg {
        transform: rotate(-270deg);
    }
}

//

@media (max-width: 1440px) {
    .admin-catalog-top {
        flex-wrap: wrap;
        gap: 10px;
    }
    .admin-catalog-top__form {
        margin-left: unset;
    }
    .admin-catalog-swiper-slide__top-link {
        @include adaptiv-value("font-size", 24, 16, 1);
        @include adaptiv-value("line-height", 24, 18, 1);
    }
    .admin-catalog-swiper-slide__top-btn {
        @include adaptiv-value("padding", 12, 8, 1);
        @include adaptiv-value("font-size", 16, 14, 1);
        @include adaptiv-value("line-height", 24, 18, 1);
        @include adaptiv-value("gap", 10, 5, 1);
        @include adaptiv-value("width", 135, 130, 1);
        @include adaptiv-value("max-width", 135, 130, 1);
    }
    .admin-catalog-swiper-slide__top {
        @include adaptiv-value("margin-bottom", 30, 20, 1);
    }
    .admin-catalog-swiper .swiper-button-prev {
        @include adaptiv-value("width", 48, 30, 1);
        @include adaptiv-value("height", 48, 30, 1);
        &:before {
            @include adaptiv-value("width", 32, 20, 1);
            @include adaptiv-value("height", 32, 20, 1);
            background-size: cover;
        }
    }
    .admin-catalog-swiper .swiper-button-next {
        @include adaptiv-value("width", 48, 30, 1);
        @include adaptiv-value("height", 48, 30, 1);
        &:before {
            @include adaptiv-value("width", 32, 20, 1);
            @include adaptiv-value("height", 32, 20, 1);
            background-size: cover;
        }
    }
    .admin-catalog-swiper .swiper-pagination-bullet {
        background: #FFFFFF;
        @include adaptiv-value("width", 48, 30, 1);
        @include adaptiv-value("height", 48, 30, 1);
    }
    .main-admin-catalog {
        @include adaptiv-value("padding-top", 30, 30, 1);
        @include adaptiv-value("padding-right", 55, 30, 1);
        @include adaptiv-value("padding-bottom", 35, 30, 1);
        @include adaptiv-value("padding-left", 55, 30, 1);
    }
    .admin-catalog-swiper {
        @include adaptiv-value("max-width", 1450, 100, 1);
    }
    .admin-catalog-swiper-slide {
        @include adaptiv-value("padding-bottom", 365, 100, 1);
    }

    .admin-catalog-swiper-slide-row__text {
        @include adaptiv-value("font-size", 16, 14, 1);
        @include adaptiv-value("line-height", 24, 18, 1);
    }
    .admin-catalog-swiper .swiper-pagination {
        max-width: 500px;
        position: absolute;
        margin-left: auto;
        right: 0;
        bottom: 0;
        top: unset !important;
        display: flex;
        justify-content: flex-end;
        @include adaptiv-value("padding-right", 60, 23, 1);
    }
}
@media (max-width: 1350px) {
    .admin-catalog-top__form {
        width: 100%;
    }
}
@media (max-width: 1300px) {
    .big-wrapper {
        max-width: 100%;
    }
    .admin-catalog-swiper {
        max-width: 100%;
    }
}

@media (max-width: 750px) {
    .import-history-count {
        bottom: 50px;
    }
    .admin-catalog-swiper .swiper-pagination {
        justify-content: flex-start;
        margin-left: unset;
        margin-right: auto;
        padding-left: 58px;
        padding-right: unset;
    }
    .admin-catalog-swiper .swiper-button-prev {
        left: 0;
        transform: unset;
    }
    .iadmin-catalog-swiper .swiper-button-next {
        right: unset;
        @include adaptiv-value("left", 300, 250, 1);
    }
}

@media (max-width: 550px) {
    .admin-catalog-top {
        flex-direction: column;
        align-items: flex-start;
    }
    .admin-catalog-top-select{
        margin-left: unset;
    }
}

@media (max-width: 450px) {
    .import-history-swiper-slide__top {
        flex-direction: column;
        align-items: flex-start;
        gap: 20px;
    }
}
</style>