<template>
    <div class="biggest-wrapper">
    <div class="big-wrapper">
        <Aside :activeLink="3" :sideMenuActive="this.sideMenuActive" :isAdmin="true" />
        <div class="wrapper">
            <Header :searchIsActive="false" :title="'Планирование'" @openSideMenu="SideMenuToActive" :isAdmin="true" />
            <main class="main main-planing">
                <section class="main__planing planing">
                    <swiper class="planing__swiper planing-swiper swiper" :allowTouchMove="false" :modules="modules" :slides-per-view="1" :speed="1"
                        :space-between="200" navigation :pagination="{ clickable: true, }" :loop="true" @swiper="onSwiper"
                        @slideChange="onSlideChange">
                        <swiper-slide class="planing-swiper__slide planing-swiper-slide">
                            <div class="planing-swiper-slide__top planing-swiper-slide-top">
                                <PageEntrySelect :options="['Группа', 'Группа 1', ' Группа 2', 'Группа 3']"
                                    :default="'Группа'" class="planing-swiper-slide-top__select">
                                </PageEntrySelect>
                                <PageEntrySelect :options="['Курсы', 'Курсы 1', ' Курсы 2', 'Курсы 3']" :default="'Курсы'"
                                    class="planing-swiper-slide-top__select">
                                </PageEntrySelect>
                                <div class="planing-swiper-slide-top__buttons">
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M13.4099 12.0002L17.7099 7.71019C17.8982 7.52188 18.004 7.26649 18.004 7.00019C18.004 6.73388 17.8982 6.47849 17.7099 6.29019C17.5216 6.10188 17.2662 5.99609 16.9999 5.99609C16.7336 5.99609 16.4782 6.10188 16.2899 6.29019L11.9999 10.5902L7.70994 6.29019C7.52164 6.10188 7.26624 5.99609 6.99994 5.99609C6.73364 5.99609 6.47824 6.10188 6.28994 6.29019C6.10164 6.47849 5.99585 6.73388 5.99585 7.00019C5.99585 7.26649 6.10164 7.52188 6.28994 7.71019L10.5899 12.0002L6.28994 16.2902C6.19621 16.3832 6.12182 16.4938 6.07105 16.6156C6.02028 16.7375 5.99414 16.8682 5.99414 17.0002C5.99414 17.1322 6.02028 17.2629 6.07105 17.3848C6.12182 17.5066 6.19621 17.6172 6.28994 17.7102C6.3829 17.8039 6.4935 17.8783 6.61536 17.9291C6.73722 17.9798 6.86793 18.006 6.99994 18.006C7.13195 18.006 7.26266 17.9798 7.38452 17.9291C7.50637 17.8783 7.61698 17.8039 7.70994 17.7102L11.9999 13.4102L16.2899 17.7102C16.3829 17.8039 16.4935 17.8783 16.6154 17.9291C16.7372 17.9798 16.8679 18.006 16.9999 18.006C17.132 18.006 17.2627 17.9798 17.3845 17.9291C17.5064 17.8783 17.617 17.8039 17.7099 17.7102C17.8037 17.6172 17.8781 17.5066 17.9288 17.3848C17.9796 17.2629 18.0057 17.1322 18.0057 17.0002C18.0057 16.8682 17.9796 16.7375 17.9288 16.6156C17.8781 16.4938 17.8037 16.3832 17.7099 16.2902L13.4099 12.0002Z"
                                                    fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Отменить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="11" height="14" viewBox="0 0 11 14" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path d="M8.63965 0.5H10.6396V13.5H8.63965V0.5Z" fill="#1294F2" />
                                                <path d="M0 0.5H2V13.5H0V0.5Z" fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Приостоновить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="33" height="32" viewBox="0 0 33 32" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M25.833 14.6663H17.833V6.66634C17.833 6.31272 17.6925 5.97358 17.4425 5.72353C17.1924 5.47348 16.8533 5.33301 16.4997 5.33301C16.1461 5.33301 15.8069 5.47348 15.5569 5.72353C15.3068 5.97358 15.1663 6.31272 15.1663 6.66634V14.6663H7.16634C6.81272 14.6663 6.47358 14.8068 6.22353 15.0569C5.97348 15.3069 5.83301 15.6461 5.83301 15.9997C5.83301 16.3533 5.97348 16.6924 6.22353 16.9425C6.47358 17.1925 6.81272 17.333 7.16634 17.333H15.1663V25.333C15.1663 25.6866 15.3068 26.0258 15.5569 26.2758C15.8069 26.5259 16.1461 26.6663 16.4997 26.6663C16.8533 26.6663 17.1924 26.5259 17.4425 26.2758C17.6925 26.0258 17.833 25.6866 17.833 25.333V17.333H25.833C26.1866 17.333 26.5258 17.1925 26.7758 16.9425C27.0259 16.6924 27.1663 16.3533 27.1663 15.9997C27.1663 15.6461 27.0259 15.3069 26.7758 15.0569C26.5258 14.8068 26.1866 14.6663 25.833 14.6663Z"
                                                    fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Добавить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="17" height="16" viewBox="0 0 17 16" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M14.6393 3.99962H11.306V2.88628C11.2903 2.4595 11.1061 2.05632 10.7937 1.76515C10.4813 1.47397 10.0662 1.31855 9.63932 1.33295H7.63932C7.21249 1.31855 6.79736 1.47397 6.48494 1.76515C6.17252 2.05632 5.9883 2.4595 5.97266 2.88628V3.99962H2.63932C2.46251 3.99962 2.29294 4.06985 2.16792 4.19488C2.04289 4.3199 1.97266 4.48947 1.97266 4.66628C1.97266 4.84309 2.04289 5.01266 2.16792 5.13769C2.29294 5.26271 2.46251 5.33295 2.63932 5.33295H3.30599V12.6663C3.30599 13.1967 3.5167 13.7054 3.89178 14.0805C4.26685 14.4556 4.77556 14.6663 5.30599 14.6663H11.9727C12.5031 14.6663 13.0118 14.4556 13.3869 14.0805C13.7619 13.7054 13.9727 13.1967 13.9727 12.6663V5.33295H14.6393C14.8161 5.33295 14.9857 5.26271 15.1107 5.13769C15.2358 5.01266 15.306 4.84309 15.306 4.66628C15.306 4.48947 15.2358 4.3199 15.1107 4.19488C14.9857 4.06985 14.8161 3.99962 14.6393 3.99962ZM7.30599 2.88628C7.30599 2.77962 7.44599 2.66628 7.63932 2.66628H9.63932C9.83266 2.66628 9.97266 2.77962 9.97266 2.88628V3.99962H7.30599V2.88628ZM12.6393 12.6663C12.6393 12.8431 12.5691 13.0127 12.4441 13.1377C12.319 13.2627 12.1495 13.3329 11.9727 13.3329H5.30599C5.12918 13.3329 4.95961 13.2627 4.83459 13.1377C4.70956 13.0127 4.63932 12.8431 4.63932 12.6663V5.33295H12.6393V12.6663Z"
                                                    fill="#EC4848" />
                                                <path
                                                    d="M6.63932 11.333C6.81613 11.333 6.9857 11.2628 7.11073 11.1377C7.23575 11.0127 7.30599 10.8432 7.30599 10.6663V7.99967C7.30599 7.82286 7.23575 7.65329 7.11073 7.52827C6.9857 7.40325 6.81613 7.33301 6.63932 7.33301C6.46251 7.33301 6.29294 7.40325 6.16792 7.52827C6.04289 7.65329 5.97266 7.82286 5.97266 7.99967V10.6663C5.97266 10.8432 6.04289 11.0127 6.16792 11.1377C6.29294 11.2628 6.46251 11.333 6.63932 11.333Z"
                                                    fill="#EC4848" />
                                                <path
                                                    d="M10.6393 11.333C10.8161 11.333 10.9857 11.2628 11.1107 11.1377C11.2358 11.0127 11.306 10.8432 11.306 10.6663V7.99967C11.306 7.82286 11.2358 7.65329 11.1107 7.52827C10.9857 7.40325 10.8161 7.33301 10.6393 7.33301C10.4625 7.33301 10.2929 7.40325 10.1679 7.52827C10.0429 7.65329 9.97266 7.82286 9.97266 7.99967V10.6663C9.97266 10.8432 10.0429 11.0127 10.1679 11.1377C10.2929 11.2628 10.4625 11.333 10.6393 11.333Z"
                                                    fill="#EC4848" />
                                            </svg>
                                        </span>
                                        <span>
                                            Удалить
                                        </span>
                                    </button>
                                </div>
                            </div>
                            <div class="planing-swiper-slide__inner">
                                <div class="planing-swiper-slide__row">
                                    <label class="container">
                                        <input type="checkbox" checked>
                                        <span class="checkmark"></span>
                                    </label>
                                    <p class="planing-swiper-slide__row-text">
                                        Кампания
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Статус
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Курсы
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Фиштинговая атака
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Процент успеха
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Группа
                                    </p>
                                </div>
                                <div class="planing-swiper-slide__row">
                                    <label class="container">
                                        <input type="checkbox" checked>
                                        <span class="checkmark"></span>
                                    </label>
                                    <p class="planing-swiper-slide__row-text">
                                        <span>
                                            Вводный инструктаж
                                        </span>
                                        <span>
                                            Дата начала: 24.09.2022
                                        </span>
                                        <span>
                                            Срок окончания: 24.09.2022
                                        </span>
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        В процессе
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        <span>
                                            1. Электронная почта
                                        </span>
                                        <span>
                                            2. Пароли и учетные записи
                                        </span>
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Запрос доступа к документу
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        80%
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Фин кафедра
                                    </p>
                                    <a class="planing-swiper-slide__row-link" href="#">
                                        <svg width="32" height="28" viewBox="0 0 32 28" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#1B2559"></path>
                                        </svg>
                                    </a>
                                </div>
                            </div>
                            <div class="planing-swiper-slide__count planing-swiper-slide-count">
                                <p class="planing-swiper-slide-count__text">
                                    Запись на странице
                                </p>
                                <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                </PageEntrySelect>
                            </div>
                        </swiper-slide>
                        <swiper-slide class="planing-swiper__slide planing-swiper-slide">
                            <div class="planing-swiper-slide__top planing-swiper-slide-top">
                                <PageEntrySelect :options="['Группа', 'Группа 1', ' Группа 2', 'Группа 3']"
                                    :default="'Группа'" class="planing-swiper-slide-top__select">
                                </PageEntrySelect>
                                <PageEntrySelect :options="['Курсы', 'Курсы 1', ' Курсы 2', 'Курсы 3']" :default="'Курсы'"
                                    class="planing-swiper-slide-top__select">
                                </PageEntrySelect>
                                <div class="planing-swiper-slide-top__buttons">
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M13.4099 12.0002L17.7099 7.71019C17.8982 7.52188 18.004 7.26649 18.004 7.00019C18.004 6.73388 17.8982 6.47849 17.7099 6.29019C17.5216 6.10188 17.2662 5.99609 16.9999 5.99609C16.7336 5.99609 16.4782 6.10188 16.2899 6.29019L11.9999 10.5902L7.70994 6.29019C7.52164 6.10188 7.26624 5.99609 6.99994 5.99609C6.73364 5.99609 6.47824 6.10188 6.28994 6.29019C6.10164 6.47849 5.99585 6.73388 5.99585 7.00019C5.99585 7.26649 6.10164 7.52188 6.28994 7.71019L10.5899 12.0002L6.28994 16.2902C6.19621 16.3832 6.12182 16.4938 6.07105 16.6156C6.02028 16.7375 5.99414 16.8682 5.99414 17.0002C5.99414 17.1322 6.02028 17.2629 6.07105 17.3848C6.12182 17.5066 6.19621 17.6172 6.28994 17.7102C6.3829 17.8039 6.4935 17.8783 6.61536 17.9291C6.73722 17.9798 6.86793 18.006 6.99994 18.006C7.13195 18.006 7.26266 17.9798 7.38452 17.9291C7.50637 17.8783 7.61698 17.8039 7.70994 17.7102L11.9999 13.4102L16.2899 17.7102C16.3829 17.8039 16.4935 17.8783 16.6154 17.9291C16.7372 17.9798 16.8679 18.006 16.9999 18.006C17.132 18.006 17.2627 17.9798 17.3845 17.9291C17.5064 17.8783 17.617 17.8039 17.7099 17.7102C17.8037 17.6172 17.8781 17.5066 17.9288 17.3848C17.9796 17.2629 18.0057 17.1322 18.0057 17.0002C18.0057 16.8682 17.9796 16.7375 17.9288 16.6156C17.8781 16.4938 17.8037 16.3832 17.7099 16.2902L13.4099 12.0002Z"
                                                    fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Отменить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="11" height="14" viewBox="0 0 11 14" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path d="M8.63965 0.5H10.6396V13.5H8.63965V0.5Z" fill="#1294F2" />
                                                <path d="M0 0.5H2V13.5H0V0.5Z" fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Приостоновить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="33" height="32" viewBox="0 0 33 32" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M25.833 14.6663H17.833V6.66634C17.833 6.31272 17.6925 5.97358 17.4425 5.72353C17.1924 5.47348 16.8533 5.33301 16.4997 5.33301C16.1461 5.33301 15.8069 5.47348 15.5569 5.72353C15.3068 5.97358 15.1663 6.31272 15.1663 6.66634V14.6663H7.16634C6.81272 14.6663 6.47358 14.8068 6.22353 15.0569C5.97348 15.3069 5.83301 15.6461 5.83301 15.9997C5.83301 16.3533 5.97348 16.6924 6.22353 16.9425C6.47358 17.1925 6.81272 17.333 7.16634 17.333H15.1663V25.333C15.1663 25.6866 15.3068 26.0258 15.5569 26.2758C15.8069 26.5259 16.1461 26.6663 16.4997 26.6663C16.8533 26.6663 17.1924 26.5259 17.4425 26.2758C17.6925 26.0258 17.833 25.6866 17.833 25.333V17.333H25.833C26.1866 17.333 26.5258 17.1925 26.7758 16.9425C27.0259 16.6924 27.1663 16.3533 27.1663 15.9997C27.1663 15.6461 27.0259 15.3069 26.7758 15.0569C26.5258 14.8068 26.1866 14.6663 25.833 14.6663Z"
                                                    fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Добавить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="17" height="16" viewBox="0 0 17 16" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M14.6393 3.99962H11.306V2.88628C11.2903 2.4595 11.1061 2.05632 10.7937 1.76515C10.4813 1.47397 10.0662 1.31855 9.63932 1.33295H7.63932C7.21249 1.31855 6.79736 1.47397 6.48494 1.76515C6.17252 2.05632 5.9883 2.4595 5.97266 2.88628V3.99962H2.63932C2.46251 3.99962 2.29294 4.06985 2.16792 4.19488C2.04289 4.3199 1.97266 4.48947 1.97266 4.66628C1.97266 4.84309 2.04289 5.01266 2.16792 5.13769C2.29294 5.26271 2.46251 5.33295 2.63932 5.33295H3.30599V12.6663C3.30599 13.1967 3.5167 13.7054 3.89178 14.0805C4.26685 14.4556 4.77556 14.6663 5.30599 14.6663H11.9727C12.5031 14.6663 13.0118 14.4556 13.3869 14.0805C13.7619 13.7054 13.9727 13.1967 13.9727 12.6663V5.33295H14.6393C14.8161 5.33295 14.9857 5.26271 15.1107 5.13769C15.2358 5.01266 15.306 4.84309 15.306 4.66628C15.306 4.48947 15.2358 4.3199 15.1107 4.19488C14.9857 4.06985 14.8161 3.99962 14.6393 3.99962ZM7.30599 2.88628C7.30599 2.77962 7.44599 2.66628 7.63932 2.66628H9.63932C9.83266 2.66628 9.97266 2.77962 9.97266 2.88628V3.99962H7.30599V2.88628ZM12.6393 12.6663C12.6393 12.8431 12.5691 13.0127 12.4441 13.1377C12.319 13.2627 12.1495 13.3329 11.9727 13.3329H5.30599C5.12918 13.3329 4.95961 13.2627 4.83459 13.1377C4.70956 13.0127 4.63932 12.8431 4.63932 12.6663V5.33295H12.6393V12.6663Z"
                                                    fill="#EC4848" />
                                                <path
                                                    d="M6.63932 11.333C6.81613 11.333 6.9857 11.2628 7.11073 11.1377C7.23575 11.0127 7.30599 10.8432 7.30599 10.6663V7.99967C7.30599 7.82286 7.23575 7.65329 7.11073 7.52827C6.9857 7.40325 6.81613 7.33301 6.63932 7.33301C6.46251 7.33301 6.29294 7.40325 6.16792 7.52827C6.04289 7.65329 5.97266 7.82286 5.97266 7.99967V10.6663C5.97266 10.8432 6.04289 11.0127 6.16792 11.1377C6.29294 11.2628 6.46251 11.333 6.63932 11.333Z"
                                                    fill="#EC4848" />
                                                <path
                                                    d="M10.6393 11.333C10.8161 11.333 10.9857 11.2628 11.1107 11.1377C11.2358 11.0127 11.306 10.8432 11.306 10.6663V7.99967C11.306 7.82286 11.2358 7.65329 11.1107 7.52827C10.9857 7.40325 10.8161 7.33301 10.6393 7.33301C10.4625 7.33301 10.2929 7.40325 10.1679 7.52827C10.0429 7.65329 9.97266 7.82286 9.97266 7.99967V10.6663C9.97266 10.8432 10.0429 11.0127 10.1679 11.1377C10.2929 11.2628 10.4625 11.333 10.6393 11.333Z"
                                                    fill="#EC4848" />
                                            </svg>
                                        </span>
                                        <span>
                                            Удалить
                                        </span>
                                    </button>
                                </div>
                            </div>
                            <div class="planing-swiper-slide__inner">
                                <div class="planing-swiper-slide__row">
                                    <label class="container">
                                        <input type="checkbox" checked>
                                        <span class="checkmark"></span>
                                    </label>
                                    <p class="planing-swiper-slide__row-text">
                                        Кампания
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Статус
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Курсы
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Фиштинговая атака
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Процент успеха
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Группа
                                    </p>
                                </div>
                                <div class="planing-swiper-slide__row">
                                    <label class="container">
                                        <input type="checkbox" checked>
                                        <span class="checkmark"></span>
                                    </label>
                                    <p class="planing-swiper-slide__row-text">
                                        <span>
                                            Вводный инструктаж
                                        </span>
                                        <span>
                                            Дата начала: 24.09.2022
                                        </span>
                                        <span>
                                            Срок окончания: 24.09.2022
                                        </span>
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        В процессе
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        <span>
                                            1. Электронная почта
                                        </span>
                                        <span>
                                            2. Пароли и учетные записи
                                        </span>
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Запрос доступа к документу
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        92%
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Фин кафедра
                                    </p>
                                    <a class="planing-swiper-slide__row-link" href="#">
                                        <svg width="32" height="28" viewBox="0 0 32 28" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#1B2559"></path>
                                        </svg>
                                    </a>
                                </div>
                            </div>
                            <div class="planing-swiper-slide__count planing-swiper-slide-count">
                                <p class="planing-swiper-slide-count__text">
                                    Запись на странице
                                </p>
                                <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                </PageEntrySelect>
                            </div>
                        </swiper-slide>
                        <swiper-slide class="planing-swiper__slide planing-swiper-slide">
                            <div class="planing-swiper-slide__top planing-swiper-slide-top">
                                <PageEntrySelect :options="['Группа', 'Группа 1', ' Группа 2', 'Группа 3']"
                                    :default="'Группа'" class="planing-swiper-slide-top__select">
                                </PageEntrySelect>
                                <PageEntrySelect :options="['Курсы', 'Курсы 1', ' Курсы 2', 'Курсы 3']" :default="'Курсы'"
                                    class="planing-swiper-slide-top__select">
                                </PageEntrySelect>
                                <div class="planing-swiper-slide-top__buttons">
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M13.4099 12.0002L17.7099 7.71019C17.8982 7.52188 18.004 7.26649 18.004 7.00019C18.004 6.73388 17.8982 6.47849 17.7099 6.29019C17.5216 6.10188 17.2662 5.99609 16.9999 5.99609C16.7336 5.99609 16.4782 6.10188 16.2899 6.29019L11.9999 10.5902L7.70994 6.29019C7.52164 6.10188 7.26624 5.99609 6.99994 5.99609C6.73364 5.99609 6.47824 6.10188 6.28994 6.29019C6.10164 6.47849 5.99585 6.73388 5.99585 7.00019C5.99585 7.26649 6.10164 7.52188 6.28994 7.71019L10.5899 12.0002L6.28994 16.2902C6.19621 16.3832 6.12182 16.4938 6.07105 16.6156C6.02028 16.7375 5.99414 16.8682 5.99414 17.0002C5.99414 17.1322 6.02028 17.2629 6.07105 17.3848C6.12182 17.5066 6.19621 17.6172 6.28994 17.7102C6.3829 17.8039 6.4935 17.8783 6.61536 17.9291C6.73722 17.9798 6.86793 18.006 6.99994 18.006C7.13195 18.006 7.26266 17.9798 7.38452 17.9291C7.50637 17.8783 7.61698 17.8039 7.70994 17.7102L11.9999 13.4102L16.2899 17.7102C16.3829 17.8039 16.4935 17.8783 16.6154 17.9291C16.7372 17.9798 16.8679 18.006 16.9999 18.006C17.132 18.006 17.2627 17.9798 17.3845 17.9291C17.5064 17.8783 17.617 17.8039 17.7099 17.7102C17.8037 17.6172 17.8781 17.5066 17.9288 17.3848C17.9796 17.2629 18.0057 17.1322 18.0057 17.0002C18.0057 16.8682 17.9796 16.7375 17.9288 16.6156C17.8781 16.4938 17.8037 16.3832 17.7099 16.2902L13.4099 12.0002Z"
                                                    fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Отменить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="11" height="14" viewBox="0 0 11 14" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path d="M8.63965 0.5H10.6396V13.5H8.63965V0.5Z" fill="#1294F2" />
                                                <path d="M0 0.5H2V13.5H0V0.5Z" fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Приостоновить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="33" height="32" viewBox="0 0 33 32" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M25.833 14.6663H17.833V6.66634C17.833 6.31272 17.6925 5.97358 17.4425 5.72353C17.1924 5.47348 16.8533 5.33301 16.4997 5.33301C16.1461 5.33301 15.8069 5.47348 15.5569 5.72353C15.3068 5.97358 15.1663 6.31272 15.1663 6.66634V14.6663H7.16634C6.81272 14.6663 6.47358 14.8068 6.22353 15.0569C5.97348 15.3069 5.83301 15.6461 5.83301 15.9997C5.83301 16.3533 5.97348 16.6924 6.22353 16.9425C6.47358 17.1925 6.81272 17.333 7.16634 17.333H15.1663V25.333C15.1663 25.6866 15.3068 26.0258 15.5569 26.2758C15.8069 26.5259 16.1461 26.6663 16.4997 26.6663C16.8533 26.6663 17.1924 26.5259 17.4425 26.2758C17.6925 26.0258 17.833 25.6866 17.833 25.333V17.333H25.833C26.1866 17.333 26.5258 17.1925 26.7758 16.9425C27.0259 16.6924 27.1663 16.3533 27.1663 15.9997C27.1663 15.6461 27.0259 15.3069 26.7758 15.0569C26.5258 14.8068 26.1866 14.6663 25.833 14.6663Z"
                                                    fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Добавить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="17" height="16" viewBox="0 0 17 16" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M14.6393 3.99962H11.306V2.88628C11.2903 2.4595 11.1061 2.05632 10.7937 1.76515C10.4813 1.47397 10.0662 1.31855 9.63932 1.33295H7.63932C7.21249 1.31855 6.79736 1.47397 6.48494 1.76515C6.17252 2.05632 5.9883 2.4595 5.97266 2.88628V3.99962H2.63932C2.46251 3.99962 2.29294 4.06985 2.16792 4.19488C2.04289 4.3199 1.97266 4.48947 1.97266 4.66628C1.97266 4.84309 2.04289 5.01266 2.16792 5.13769C2.29294 5.26271 2.46251 5.33295 2.63932 5.33295H3.30599V12.6663C3.30599 13.1967 3.5167 13.7054 3.89178 14.0805C4.26685 14.4556 4.77556 14.6663 5.30599 14.6663H11.9727C12.5031 14.6663 13.0118 14.4556 13.3869 14.0805C13.7619 13.7054 13.9727 13.1967 13.9727 12.6663V5.33295H14.6393C14.8161 5.33295 14.9857 5.26271 15.1107 5.13769C15.2358 5.01266 15.306 4.84309 15.306 4.66628C15.306 4.48947 15.2358 4.3199 15.1107 4.19488C14.9857 4.06985 14.8161 3.99962 14.6393 3.99962ZM7.30599 2.88628C7.30599 2.77962 7.44599 2.66628 7.63932 2.66628H9.63932C9.83266 2.66628 9.97266 2.77962 9.97266 2.88628V3.99962H7.30599V2.88628ZM12.6393 12.6663C12.6393 12.8431 12.5691 13.0127 12.4441 13.1377C12.319 13.2627 12.1495 13.3329 11.9727 13.3329H5.30599C5.12918 13.3329 4.95961 13.2627 4.83459 13.1377C4.70956 13.0127 4.63932 12.8431 4.63932 12.6663V5.33295H12.6393V12.6663Z"
                                                    fill="#EC4848" />
                                                <path
                                                    d="M6.63932 11.333C6.81613 11.333 6.9857 11.2628 7.11073 11.1377C7.23575 11.0127 7.30599 10.8432 7.30599 10.6663V7.99967C7.30599 7.82286 7.23575 7.65329 7.11073 7.52827C6.9857 7.40325 6.81613 7.33301 6.63932 7.33301C6.46251 7.33301 6.29294 7.40325 6.16792 7.52827C6.04289 7.65329 5.97266 7.82286 5.97266 7.99967V10.6663C5.97266 10.8432 6.04289 11.0127 6.16792 11.1377C6.29294 11.2628 6.46251 11.333 6.63932 11.333Z"
                                                    fill="#EC4848" />
                                                <path
                                                    d="M10.6393 11.333C10.8161 11.333 10.9857 11.2628 11.1107 11.1377C11.2358 11.0127 11.306 10.8432 11.306 10.6663V7.99967C11.306 7.82286 11.2358 7.65329 11.1107 7.52827C10.9857 7.40325 10.8161 7.33301 10.6393 7.33301C10.4625 7.33301 10.2929 7.40325 10.1679 7.52827C10.0429 7.65329 9.97266 7.82286 9.97266 7.99967V10.6663C9.97266 10.8432 10.0429 11.0127 10.1679 11.1377C10.2929 11.2628 10.4625 11.333 10.6393 11.333Z"
                                                    fill="#EC4848" />
                                            </svg>
                                        </span>
                                        <span>
                                            Удалить
                                        </span>
                                    </button>
                                </div>
                            </div>
                            <div class="planing-swiper-slide__inner">
                                <div class="planing-swiper-slide__row">
                                    <label class="container">
                                        <input type="checkbox" checked>
                                        <span class="checkmark"></span>
                                    </label>
                                    <p class="planing-swiper-slide__row-text">
                                        Кампания
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Статус
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Курсы
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Фиштинговая атака
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Процент успеха
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Группа
                                    </p>
                                </div>
                                <div class="planing-swiper-slide__row">
                                    <label class="container">
                                        <input type="checkbox" checked>
                                        <span class="checkmark"></span>
                                    </label>
                                    <p class="planing-swiper-slide__row-text">
                                        <span>
                                            Вводный инструктаж
                                        </span>
                                        <span>
                                            Дата начала: 24.09.2022
                                        </span>
                                        <span>
                                            Срок окончания: 24.09.2022
                                        </span>
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        В процессе
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        <span>
                                            1. Электронная почта
                                        </span>
                                        <span>
                                            2. Пароли и учетные записи
                                        </span>
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Запрос доступа к документу
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        30%
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Фин кафедра
                                    </p>
                                    <a class="planing-swiper-slide__row-link" href="#">
                                        <svg width="32" height="28" viewBox="0 0 32 28" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#1B2559"></path>
                                        </svg>
                                    </a>
                                </div>
                            </div>
                            <div class="planing-swiper-slide__count planing-swiper-slide-count">
                                <p class="planing-swiper-slide-count__text">
                                    Запись на странице
                                </p>
                                <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                </PageEntrySelect>
                            </div>
                        </swiper-slide>
                        <swiper-slide class="planing-swiper__slide planing-swiper-slide">
                            <div class="planing-swiper-slide__top planing-swiper-slide-top">
                                <PageEntrySelect :options="['Группа', 'Группа 1', ' Группа 2', 'Группа 3']"
                                    :default="'Группа'" class="planing-swiper-slide-top__select">
                                </PageEntrySelect>
                                <PageEntrySelect :options="['Курсы', 'Курсы 1', ' Курсы 2', 'Курсы 3']" :default="'Курсы'"
                                    class="planing-swiper-slide-top__select">
                                </PageEntrySelect>
                                <div class="planing-swiper-slide-top__buttons">
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M13.4099 12.0002L17.7099 7.71019C17.8982 7.52188 18.004 7.26649 18.004 7.00019C18.004 6.73388 17.8982 6.47849 17.7099 6.29019C17.5216 6.10188 17.2662 5.99609 16.9999 5.99609C16.7336 5.99609 16.4782 6.10188 16.2899 6.29019L11.9999 10.5902L7.70994 6.29019C7.52164 6.10188 7.26624 5.99609 6.99994 5.99609C6.73364 5.99609 6.47824 6.10188 6.28994 6.29019C6.10164 6.47849 5.99585 6.73388 5.99585 7.00019C5.99585 7.26649 6.10164 7.52188 6.28994 7.71019L10.5899 12.0002L6.28994 16.2902C6.19621 16.3832 6.12182 16.4938 6.07105 16.6156C6.02028 16.7375 5.99414 16.8682 5.99414 17.0002C5.99414 17.1322 6.02028 17.2629 6.07105 17.3848C6.12182 17.5066 6.19621 17.6172 6.28994 17.7102C6.3829 17.8039 6.4935 17.8783 6.61536 17.9291C6.73722 17.9798 6.86793 18.006 6.99994 18.006C7.13195 18.006 7.26266 17.9798 7.38452 17.9291C7.50637 17.8783 7.61698 17.8039 7.70994 17.7102L11.9999 13.4102L16.2899 17.7102C16.3829 17.8039 16.4935 17.8783 16.6154 17.9291C16.7372 17.9798 16.8679 18.006 16.9999 18.006C17.132 18.006 17.2627 17.9798 17.3845 17.9291C17.5064 17.8783 17.617 17.8039 17.7099 17.7102C17.8037 17.6172 17.8781 17.5066 17.9288 17.3848C17.9796 17.2629 18.0057 17.1322 18.0057 17.0002C18.0057 16.8682 17.9796 16.7375 17.9288 16.6156C17.8781 16.4938 17.8037 16.3832 17.7099 16.2902L13.4099 12.0002Z"
                                                    fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Отменить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="11" height="14" viewBox="0 0 11 14" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path d="M8.63965 0.5H10.6396V13.5H8.63965V0.5Z" fill="#1294F2" />
                                                <path d="M0 0.5H2V13.5H0V0.5Z" fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Приостоновить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="33" height="32" viewBox="0 0 33 32" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M25.833 14.6663H17.833V6.66634C17.833 6.31272 17.6925 5.97358 17.4425 5.72353C17.1924 5.47348 16.8533 5.33301 16.4997 5.33301C16.1461 5.33301 15.8069 5.47348 15.5569 5.72353C15.3068 5.97358 15.1663 6.31272 15.1663 6.66634V14.6663H7.16634C6.81272 14.6663 6.47358 14.8068 6.22353 15.0569C5.97348 15.3069 5.83301 15.6461 5.83301 15.9997C5.83301 16.3533 5.97348 16.6924 6.22353 16.9425C6.47358 17.1925 6.81272 17.333 7.16634 17.333H15.1663V25.333C15.1663 25.6866 15.3068 26.0258 15.5569 26.2758C15.8069 26.5259 16.1461 26.6663 16.4997 26.6663C16.8533 26.6663 17.1924 26.5259 17.4425 26.2758C17.6925 26.0258 17.833 25.6866 17.833 25.333V17.333H25.833C26.1866 17.333 26.5258 17.1925 26.7758 16.9425C27.0259 16.6924 27.1663 16.3533 27.1663 15.9997C27.1663 15.6461 27.0259 15.3069 26.7758 15.0569C26.5258 14.8068 26.1866 14.6663 25.833 14.6663Z"
                                                    fill="#1294F2" />
                                            </svg>
                                        </span>
                                        <span>
                                            Добавить
                                        </span>
                                    </button>
                                    <button class="planing-swiper-slide-top__buttons-btn" type="button">
                                        <span>
                                            <svg width="17" height="16" viewBox="0 0 17 16" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M14.6393 3.99962H11.306V2.88628C11.2903 2.4595 11.1061 2.05632 10.7937 1.76515C10.4813 1.47397 10.0662 1.31855 9.63932 1.33295H7.63932C7.21249 1.31855 6.79736 1.47397 6.48494 1.76515C6.17252 2.05632 5.9883 2.4595 5.97266 2.88628V3.99962H2.63932C2.46251 3.99962 2.29294 4.06985 2.16792 4.19488C2.04289 4.3199 1.97266 4.48947 1.97266 4.66628C1.97266 4.84309 2.04289 5.01266 2.16792 5.13769C2.29294 5.26271 2.46251 5.33295 2.63932 5.33295H3.30599V12.6663C3.30599 13.1967 3.5167 13.7054 3.89178 14.0805C4.26685 14.4556 4.77556 14.6663 5.30599 14.6663H11.9727C12.5031 14.6663 13.0118 14.4556 13.3869 14.0805C13.7619 13.7054 13.9727 13.1967 13.9727 12.6663V5.33295H14.6393C14.8161 5.33295 14.9857 5.26271 15.1107 5.13769C15.2358 5.01266 15.306 4.84309 15.306 4.66628C15.306 4.48947 15.2358 4.3199 15.1107 4.19488C14.9857 4.06985 14.8161 3.99962 14.6393 3.99962ZM7.30599 2.88628C7.30599 2.77962 7.44599 2.66628 7.63932 2.66628H9.63932C9.83266 2.66628 9.97266 2.77962 9.97266 2.88628V3.99962H7.30599V2.88628ZM12.6393 12.6663C12.6393 12.8431 12.5691 13.0127 12.4441 13.1377C12.319 13.2627 12.1495 13.3329 11.9727 13.3329H5.30599C5.12918 13.3329 4.95961 13.2627 4.83459 13.1377C4.70956 13.0127 4.63932 12.8431 4.63932 12.6663V5.33295H12.6393V12.6663Z"
                                                    fill="#EC4848" />
                                                <path
                                                    d="M6.63932 11.333C6.81613 11.333 6.9857 11.2628 7.11073 11.1377C7.23575 11.0127 7.30599 10.8432 7.30599 10.6663V7.99967C7.30599 7.82286 7.23575 7.65329 7.11073 7.52827C6.9857 7.40325 6.81613 7.33301 6.63932 7.33301C6.46251 7.33301 6.29294 7.40325 6.16792 7.52827C6.04289 7.65329 5.97266 7.82286 5.97266 7.99967V10.6663C5.97266 10.8432 6.04289 11.0127 6.16792 11.1377C6.29294 11.2628 6.46251 11.333 6.63932 11.333Z"
                                                    fill="#EC4848" />
                                                <path
                                                    d="M10.6393 11.333C10.8161 11.333 10.9857 11.2628 11.1107 11.1377C11.2358 11.0127 11.306 10.8432 11.306 10.6663V7.99967C11.306 7.82286 11.2358 7.65329 11.1107 7.52827C10.9857 7.40325 10.8161 7.33301 10.6393 7.33301C10.4625 7.33301 10.2929 7.40325 10.1679 7.52827C10.0429 7.65329 9.97266 7.82286 9.97266 7.99967V10.6663C9.97266 10.8432 10.0429 11.0127 10.1679 11.1377C10.2929 11.2628 10.4625 11.333 10.6393 11.333Z"
                                                    fill="#EC4848" />
                                            </svg>
                                        </span>
                                        <span>
                                            Удалить
                                        </span>
                                    </button>
                                </div>
                            </div>
                            <div class="planing-swiper-slide__inner">
                                <div class="planing-swiper-slide__row">
                                    <label class="container">
                                        <input type="checkbox" checked>
                                        <span class="checkmark"></span>
                                    </label>
                                    <p class="planing-swiper-slide__row-text">
                                        Кампания
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Статус
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Курсы
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Фиштинговая атака
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Процент успеха
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Группа
                                    </p>
                                </div>
                                <div class="planing-swiper-slide__row">
                                    <label class="container">
                                        <input type="checkbox" checked>
                                        <span class="checkmark"></span>
                                    </label>
                                    <p class="planing-swiper-slide__row-text">
                                        <span>
                                            Вводный инструктаж
                                        </span>
                                        <span>
                                            Дата начала: 24.09.2022
                                        </span>
                                        <span>
                                            Срок окончания: 24.09.2022
                                        </span>
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        В процессе
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        <span>
                                            1. Электронная почта
                                        </span>
                                        <span>
                                            2. Пароли и учетные записи
                                        </span>
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Запрос доступа к документу
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        22%
                                    </p>
                                    <p class="planing-swiper-slide__row-text">
                                        Фин кафедра
                                    </p>
                                    <a class="planing-swiper-slide__row-link" href="#">
                                        <svg width="32" height="28" viewBox="0 0 32 28" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M18.4396 21.6358C18.2404 21.6364 18.0436 21.5988 17.8636 21.5259C17.6836 21.453 17.5251 21.3466 17.3996 21.2145L10.9596 14.3821C10.7635 14.1783 10.6562 13.9228 10.6562 13.659C10.6562 13.3953 10.7635 13.1397 10.9596 12.9359L17.6262 6.10356C17.8526 5.87101 18.1778 5.72477 18.5303 5.69701C18.8829 5.66925 19.2339 5.76224 19.5062 5.95553C19.7785 6.14881 19.9498 6.42656 19.9823 6.72767C20.0148 7.02878 19.9059 7.32858 19.6796 7.56113L13.7196 13.6647L19.4796 19.7683C19.6426 19.9354 19.7462 20.139 19.778 20.3548C19.8099 20.5707 19.7686 20.7898 19.6592 20.9862C19.5498 21.1827 19.3768 21.3483 19.1607 21.4634C18.9445 21.5785 18.6943 21.6383 18.4396 21.6358Z"
                                                fill="#1B2559"></path>
                                        </svg>
                                    </a>
                                </div>
                            </div>
                            <div class="planing-swiper-slide__count planing-swiper-slide-count">
                                <p class="planing-swiper-slide-count__text">
                                    Запись на странице
                                </p>
                                <PageEntrySelect :options="['1', '2', ' 3', '4']" :default="'4'" class="select">
                                </PageEntrySelect>
                            </div>
                        </swiper-slide>
                    </swiper>
                </section>
            </main>
            <Footer />
        </div>
    </div>
    </div>
</template>

<script>
import Aside from '../../components/portal-components/Aside.vue';
import Header from '../../components/portal-components/Header.vue';
import Footer from '../../components/portal-components/Footer.vue';
import NewCursSelect from '../../components/admin-components/New-curs-select.vue';
import PageEntrySelect from '../../components/admin-components/Page-entry-select.vue';

import { Pagination, Autoplay, Navigation } from 'swiper';
import { Swiper, SwiperSlide } from 'swiper/vue';

import 'swiper/css';
import 'swiper/css/pagination';

export default {
    components: {
        Aside,
        Header,
        Footer,
        NewCursSelect,
        PageEntrySelect,
        Swiper,
        SwiperSlide,
    },
    data() {
        return {
            sideMenuActive: false,
        }
    },
    setup() {
        const onSwiper = (swiper) => {
        };
        const onSlideChange = () => {
        };
        return {
            onSwiper,
            onSlideChange,
            modules: [Pagination, Autoplay, Navigation],
        };
    },
    methods: {
        changedInfo() {
        },
        SideMenuToActive() {
            if (this.sideMenuActive == true) {
                this.sideMenuActive = false
            } else {
                this.sideMenuActive = true
            }
        }
    }

}
</script>


<style lang="scss">
@import '../../assets/scss/vars';

.main-planing {
    padding: 25px 55px 30px 55px;

  
}

.planing {}

.planing-swiper {
    max-width: 1450px;
    position: relative;
    width: 100%;

    .swiper-pagination {
        max-width: 500px;
        position: absolute;
        margin-left: auto;
        right: 0;
        bottom: 0;
        top: unset !important;
        display: flex;
        justify-content: flex-end;
        padding-right: 58px;
    }

    .swiper-pagination-bullet {
        background: #FFFFFF;
        width: 48px;
        height: 48px;
        opacity: 1;
        border: 1px solid #96A5B8;
        border-radius: 6px;
        font-weight: 500;
        font-size: 16px;
        line-height: 24px;
        color: #96A5B8;
        transition: background 0.3s, color 0.3s border 0.3s;
        margin-left: 5px !important;
        position: relative;
        margin-right: 5px !important;

        &:hover {
            background: #1294F2;
            color: #fff;
            border: 1px solid #1294F2;

            &::before {
                color: #fff;
            }
        }

        &::before {
            content: '';
            transition: color 0.3s;
            position: absolute;
            top: 50%;
            left: 50%;
            font-weight: 500;
            font-size: 16px;
            line-height: 24px;
            color: #96A5B8;
            transform: translateX(-50%) translateY(-50%);
        }

        &:nth-child(1) {
            &::before {
                content: '1';
            }
        }

        &:nth-child(2) {
            &::before {
                content: '2';
            }
        }

        &:nth-child(3) {
            &::before {
                content: '3';
            }
        }

        &:nth-child(4) {
            &::before {
                content: '4';
            }
        }
    }

    .swiper-pagination-bullet-active {
        background: #1294F2 !important;
        color: #fff;
        border: 1px solid #1294F2;

        &::before {
            color: #fff;
        }
    }

    .swiper-button-prev {
        cursor: pointer;
        position: relative;
        background: #FFFFFF;
        width: 48px;
        height: 48px;
        border: 1px solid #96A5B8;
        border-radius: 6px;
        position: absolute;
        right: 0;
        transform: translateX(-615%);
        bottom: 0;
        z-index: 20;

        &::before {
            content: '';
            position: absolute;
            top: 50%;
            left: 50%;
            transform: translateX(-50%) translateY(-50%) rotate(90deg);
            width: 32px;
            height: 32px;
            background-repeat: no-repeat;
            background-image: url(../../../public/images/reg-two-arrow.svg);
        }
    }

    .swiper-button-next {
        cursor: pointer;
        z-index: 20;
        position: absolute;
        background: #FFFFFF;
        width: 48px;
        height: 48px;
        border: 1px solid #96A5B8;
        border-radius: 6px;
        right: 0;
        bottom: 0;

        &::before {
            content: '';
            position: absolute;
            top: 50%;
            left: 50%;
            transform: translateX(-50%) translateY(-50%) rotate(270deg);
            width: 32px;
            height: 32px;
            background-repeat: no-repeat;
            background-image: url(../../../public/images/reg-two-arrow.svg);
        }
    }
}

.planing-swiper-slide {
    padding-bottom: 605px;
    &__inner {}

    &__row {
        &:nth-child(1) {
            .planing-swiper-slide__row-text {
                font-weight: 500;
            }
        }
        display: flex;
        align-items: center;
        padding: 15px 0;

        border-bottom: 0.5px solid #CECECE;

        .container {
            display: block;
            position: relative;
            @include adaptiv-value("padding-left", 36, 30, 1);
            cursor: pointer;
            font-weight: 400;
            @include adaptiv-value("font-size", 16, 12, 1);
            @include adaptiv-value("line-height", 24, 15, 1);
            color: #96A5B8;

            -webkit-user-select: none;
            -moz-user-select: none;
            -ms-user-select: none;
            user-select: none;
            padding-right: unset;
            margin: unset;
            transition: color 0.3s;

            &:hover {
                color: #1294F2;
            }
        }

        /* Hide the browser's default checkbox */
        .container input {
            position: absolute;
            opacity: 0;
            cursor: pointer;
            height: 0;
            width: 0;
        }

        /* Create a custom checkbox */
        .checkmark {
            position: absolute;
            top: -12px;
            left: 0;
            @include adaptiv-value("height", 24, 20, 1);
            @include adaptiv-value("width", 24, 20, 1);
            border: 2px solid #96A5B8;
            border-radius: 6px;
        }

        /* On mouse-over, add a grey background color */
        .container:hover input~.checkmark {}

        /* When the checkbox is checked, add a blue background */
        .container input:checked~.checkmark {
            border: 2px solid #96A5B8;
        }

        /* Create the checkmark/indicator (hidden when not checked) */
        .checkmark:after {
            content: "";
            position: absolute;
            display: none;
        }

        /* Show the checkmark when checked */
        .container input:checked~.checkmark:after {
            display: block;
        }

        /* Style the checkmark/indicator */
        .container .checkmark:after {
            width: 11px;
            height: 8px;
            position: absolute;
            top: 50%;
            left: 50%;
            transform: translateX(-50%) translateY(-50%);
            background-image: url(../../../public/images/reg-two-tick-icon.svg);
            background-repeat: no-repeat;
            background-size: cover;
        }
    }

    &__row-text {
        margin-left: 22px;
        &:nth-child(2) {
            margin-left: 15px;
            width: 230px;
            display: flex;
            flex-direction: column;
            span:nth-child(2) {
                font-size: 14px;
                line-height: 24px;
            }
            span:nth-child(3) {
                font-size: 14px;
                line-height: 24px;
            }
            align-items: flex-start;
            text-align: left;
            justify-content: flex-start;
        }
        &:nth-child(3) {
            width: 140px;
        }
        &:nth-child(4) {
            flex-direction: column;
            width: 300px;
        }
        &:nth-child(5) {
            width: 240px;
        }
        &:nth-child(6) {
            width: 140px;
        }
        &:nth-child(7) {
            width: 200px;
        }
        font-weight: 400;
        font-size: 16px;
        line-height: 24px;
        justify-content: center;
        text-align: center;
        display: flex;
        align-items: center;
        color: #1B2559;
    }

    &__row-link {
        transform: rotate(180deg);
        svg path {
            fill: #96A5B8;
        }   
        transition: transform 0.3s;
        &:hover {
            transform: rotate(180deg) translateX(-5px);
        }
    }
}

.planing-swiper-slide-top {
    display: flex;
    justify-content: space-between;
    gap: 20px;
    align-items: center;
    margin-bottom: 30px;

    .custom-select-entry {
        width: 135px;
    }

    .custom-select-entry .selected {
        color: #1294F2;
        font-size: 16px;
        border: 1px solid #1294F2;
        border-radius: 6px;
        position: relative;
        padding-left: 24px;
        padding-right: 45px;
    }

    .custom-select-entry .selected.open {
        border-radius: 6px 6px 0 0;
    }

    .custom-select-entry .items {
        bottom: unset;
        border: 1px solid #1294F2;
        border-top: unset;
        border-radius: 0 0 6px 6px;
    }

    .custom-select-entry .selected:after {
        width: 24px;
        right: 24px;
        top: 50%;
        transform: translateY(-50%);
        height: 24px;
        background-image: url(../../../public/images/blue-arrow-down.svg);
    }

    .custom-select-entry .selected.open::after {
        transform: translateY(-50%) rotate(180deg);
        top: 50% !important;
    }

    &__select {
        &:nth-child(2) {
            margin-right: auto;
        }
    }

    &__buttons {
        display: flex;
        gap: 25px;
        align-items: center;  
    }

    &__buttons-btn {
        font-weight: 400;
        font-size: 16px;
        line-height: 24px;
        justify-content: center;
        display: flex;
        align-items: center;
        color: #1294F2;
        gap: 8px;
        padding: 12px 25px;

        svg path {
            transition: fill 0.3s;
        }
        transition: background 0.3s, border 0.3s, color 0.3s;
        &:hover {
            background: #1294F2;
            color: #fff;
            svg path {
                fill: #fff;
            }
        }

        span:first-child {
            width: 24px;
            height: 24px;
        }

        background: #FFFFFF;
        border: 1px solid #1294F2;
        border-radius: 6px;

        &:last-child {
            color: #EC4848;
            border: 1px solid #EC4848;
            &:hover {
                background: #EC4848;
                color: #fff;
                svg path {
                    fill: #fff;
                }
            }
        }

        span:first-child {
            display: flex;
            justify-content: center;
            align-items: center;
        }

        &:nth-child(2) {
            span:first-child {
                width: 10px;
                height: 13px;

                svg {
                    width: 100%;
                    height: 100%;
                }
            }
        }

        &:nth-child(3) {
            span:first-child {
                width: 16px;
                height: 16px;

                svg {
                    width: 100%;
                    height: 100%;
                }
            }
        }

        &:nth-child(4) {

            span:first-child {
                width: 16px;
                height: 16px;

                svg {
                    width: 100%;
                    height: 100%;
                }
            }
        }
    }
}

.planing-swiper-slide-count {
    display: flex;
    align-items: center;
    gap: 10px;
    position: absolute;
    bottom: 0;
    
    &__text {
        font-size: 16px;
        line-height: 24px;
        color: #1B2559;
    }
}

// 

@media (max-width: 1440px) {
    .planing-swiper-slide-top__buttons-btn {
        @include adaptiv-value("padding-top", 12, 8, 1);
        @include adaptiv-value("padding-bottom", 12, 8, 1);
        @include adaptiv-value("padding-right", 25, 12, 1);
        @include adaptiv-value("padding-left", 25, 12, 1);
        @include adaptiv-value("font-size", 16, 14, 1);
        @include adaptiv-value("line-height", 24, 18, 1);
        @include adaptiv-value("gap", 8, 4, 1);
    }
    .planing-swiper-slide-top {
        @include adaptiv-value("margin-bottom", 30, 20, 1);
    }
    .planing-swiper .swiper-button-prev {
        @include adaptiv-value("width", 48, 30, 1);
        @include adaptiv-value("height", 48, 30, 1);
        &:before {
            @include adaptiv-value("width", 32, 20, 1);
            @include adaptiv-value("height", 32, 20, 1);
            background-size: cover;
        }
    }
    .planing-swiper .swiper-button-next {
        @include adaptiv-value("width", 48, 30, 1);
        @include adaptiv-value("height", 48, 30, 1);
        &:before {
            @include adaptiv-value("width", 32, 20, 1);
            @include adaptiv-value("height", 32, 20, 1);
            background-size: cover;
        }
    }
    .planing-swiper .swiper-pagination-bullet {
        background: #FFFFFF;
        @include adaptiv-value("width", 48, 30, 1);
        @include adaptiv-value("height", 48, 30, 1);
    }
    .main-planing {
        @include adaptiv-value("padding-top", 30, 30, 1);
        @include adaptiv-value("padding-right", 55, 30, 1);
        @include adaptiv-value("padding-bottom", 35, 30, 1);
        @include adaptiv-value("padding-left", 55, 30, 1);
    }
    .planing-swiper {
        @include adaptiv-value("max-width", 1450, 100, 1);
    }
    .planing-swiper-slide {
        @include adaptiv-value("padding-bottom", 605, 100, 1);
    }

    .planing-swiper-slide__row-text {
        @include adaptiv-value("font-size", 16, 14, 1);
        @include adaptiv-value("line-height", 24, 18, 1);
    }
    .planing-swiper .swiper-pagination {
        max-width: 500px;
        position: absolute;
        margin-left: auto;
        right: 0;
        bottom: 0;
        top: unset !important;
        display: flex;
        justify-content: flex-end;
        @include adaptiv-value("padding-right", 60, 23, 1);
    }
    .planing-swiper-slide-top {
        flex-wrap: wrap;
    }
    .planing-swiper-slide-top__select:nth-child(2) {
        margin-right: auto;
        display: block;
        width: 100%;
    }
    .planing-swiper-slide__row {
        gap: 20px;
    }
    .planing-swiper-slide__row {
        flex-direction: column;
        justify-content: flex-start;
        align-items: flex-start;
    }
    .planing-swiper-slide__row-text {
        margin-left: unset !important;
        text-align: left !important;
        align-items: flex-start;
        justify-content: flex-start !important;
    }
    .planing-swiper-slide__row .container {
        margin-top: 10px;
    }
}
@media (max-width: 1300px) {
    .big-wrapper {
        max-width: 100%;
    }
    .planing-swiper {
        max-width: 100%;
    }
}
@media (max-width: 750px) {
    .planing-swiper-slide-count {
        bottom: 50px;
    }
    .planing-swiper .swiper-pagination {
        justify-content: flex-start;
        margin-left: unset;
        margin-right: auto;
        padding-left: 58px;
        padding-right: unset;
    }
    .planing-swiper .swiper-button-prev {
        left: 0;
        transform: unset;
    }
    .planing-swiper .swiper-button-next {
        right: unset;
        @include adaptiv-value("left", 300, 250, 1);
    }
    .planing-swiper-slide-top__buttons {
        flex-wrap: wrap;
    }
}

</style>